---
kind: method
id: M:Autodesk.Revit.UI.RadioButtonGroup.GetItems
source: html/f11ea40c-b995-9677-97d6-49f40967e3e9.htm
---
# Autodesk.Revit.UI.RadioButtonGroup.GetItems Method

Gets the collection of ToggleButtons assigned to the RadioButtonGroup.

## Syntax (C#)
```csharp
public IList<ToggleButton> GetItems()
```

## Remarks
This is a copy of all the ToggleButtons assigned to this group.